app/interactions/app/app_create.rb

  def execute
    App.create!(name: name, data_source_id: data_source_id, user_id: user_id)
---
INSERT INTO "apps" ("name", "status", "user_id", "data_source_id", "created_at", "updated_at", "deleted_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"