app/interactions/page/page_create.rb

INSERT INTO "pages" ("name", "page_order", "app_id", "created_at", "updated_at", "deleted_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def execute
    Page.create!(name: name, page_order: page_order, app_id: app_id)