app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", "17058fc0-f3fd-44c6-a350-1a2da1bf25ac"], ["LIMIT", 1]]
---
  def authorize_request
    header = request.headers['Authorization']
    header = header.split(' ').last if header
    if header
    begin
      decoded = JsonWebToken.decode(header)
      @current_user = User.find(decoded[:user_id])