app/controllers/apps_controller.rb

SELECT "pages".* FROM "pages" WHERE "pages"."deleted_at" IS NULL AND "pages"."app_id" = $1 ORDER BY "pages"."page_order" ASC  [["app_id", "e3b95d08-579c-4d4f-84bd-83dd4b2788fe"]]
---
  def pages
    @pages = @app.pages.order(:page_order)

INSERT INTO "apps" ("name", "status", "user_id", "data_source_id", "created_at", "updated_at", "deleted_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @app = App.new(app_params.merge({ user_id: @current_user.id, status: "private_app" }))

    if @app.save

UPDATE "apps" SET "name" = $1, "updated_at" = $2 WHERE "apps"."id" = $3  [["name", "Job Portal AutoGen"], ["updated_at", "2022-03-01 06:51:51.531125"], ["id", "da7cbb16-8269-4549-8e89-0526664117b3"]]
---
  def update
    if @app.update(app_params)

SELECT "apps".* FROM "apps" WHERE "apps"."deleted_at" IS NULL AND "apps"."id" = $1 LIMIT $2  [["id", "b5aed1b4-9fd6-40ec-9d50-1fd057f5823e"], ["LIMIT", 1]]
---
  def set_app
    @app = App.find(params[:id])