app/controllers/authentications_controller.rb

  def login
    user = User.find_by_email(login_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ram@example.com"], ["LIMIT", 1]]