app/controllers/builders_controller.rb

  def index
    @data_sources = @current_user.data_sources
    @apps = @current_user.apps.where(status: [:public_app, :private_app])
---
SELECT "apps".* FROM "apps" WHERE "apps"."deleted_at" IS NULL AND "apps"."user_id" = $1 AND "apps"."status" IN ($2, $3)  [["user_id", "17058fc0-f3fd-44c6-a350-1a2da1bf25ac"], ["status", 1], ["status", 0]]