app/controllers/components_controller.rb

INSERT INTO "components" ("heading", "component_order", "component_type", "component_query", "page_id", "created_at", "updated_at", "settings", "deleted_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    component = Component.new(component_params)

    if component.save

UPDATE "components" SET "component_query" = $1, "updated_at" = $2, "settings" = $3 WHERE "components"."id" = $4  [["component_query", "select * from actor limit 5;"], ["updated_at", "2022-02-28 17:20:10.826499"], ["settings", "{}"], ["id", "64357fc8-4ca5-4c4a-806d-0ed119d0d9cb"]]
---
  def update
    if @component.update(component_params)