app/controllers/data_sources_controller.rb

INSERT INTO "data_sources" ("source", "settings", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    data_source = DataSource.new(data_source_params.merge({ user_id: @current_user.id }))

    if data_source.save

UPDATE "data_sources" SET "settings" = $1, "updated_at" = $2 WHERE "data_sources"."id" = $3
---
  def update
    if @data_source.update(data_source_params)

SELECT "data_sources".* FROM "data_sources" WHERE "data_sources"."id" = $1 LIMIT $2  [["id", "772f1d21-d348-42cd-b00e-bb3c34738211"], ["LIMIT", 1]]
---
    def set_data_source
      @data_source = DataSource.find(params[:id])