app/controllers/forms_controller.rb

SELECT "form_elements".* FROM "form_elements" WHERE "form_elements"."form_id" = $1 ORDER BY "form_elements"."field_order" ASC  [["form_id", "15c88fe9-1651-4a87-a43b-c3f993c4e1f7"]]
---
  def form_elements
    raise UnauthorizedError if @form.draft? && @current_user.nil?

    @form_elements = @form.form_elements.order(:field_order)

INSERT INTO "forms" ("title", "app_id", "status", "form_query", "created_at", "updated_at", "deleted_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @form = Form.new(form_params)

    if @form.save

UPDATE "forms" SET "deleted_at" = $1, "updated_at" = $2 WHERE "forms"."id" = $3  [["deleted_at", "2022-02-26 10:26:44.073916"], ["updated_at", "2022-02-26 10:26:44.073931"], ["id", "ad2841ac-00b1-4a96-8c97-25ffa4b0d356"]]
---
  def update
    if @form.update(form_params)

SELECT "forms".* FROM "forms" WHERE "forms"."deleted_at" IS NULL AND "forms"."id" = $1 LIMIT $2  [["id", "ad2841ac-00b1-4a96-8c97-25ffa4b0d356"], ["LIMIT", 1]]
---
  def set_form
    @form = Form.find(params[:id])