app/controllers/pages_controller.rb

  def components
    @components = @page.components.order(:component_order)
---
SELECT "components".* FROM "components" WHERE "components"."deleted_at" IS NULL AND "components"."page_id" = $1 ORDER BY "components"."component_order" ASC  [["page_id", "06b40f1a-2e51-4f40-9be0-d89b56ddcfa2"]]

  def create
    page = Page.new(page_params)

    if page.save
---
INSERT INTO "pages" ("name", "page_order", "app_id", "created_at", "updated_at", "deleted_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    if @page.update(page_params)
---
UPDATE "pages" SET "deleted_at" = $1, "updated_at" = $2 WHERE "pages"."id" = $3  [["deleted_at", "2022-02-26 10:24:18.125783"], ["updated_at", "2022-02-26 10:24:18.125791"], ["id", "d03601f8-bc9c-453c-9a0c-06e385eb9451"]]