app/controllers/queries_controller.rb

SELECT "data_sources".* FROM "data_sources" WHERE "data_sources"."id" = $1 LIMIT $2  [["id", "772f1d21-d348-42cd-b00e-bb3c34738211"], ["LIMIT", 1]]
---
  def set_data_source
    @data_source = DataSource.find(params[:data_source_id])