app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "ram@example.com"], ["password_digest", "[FILTERED]"], ["created_at", "2022-02-26 16:08:57.051232"], ["updated_at", "2022-02-26 16:08:57.051232"]]
---
  def create
    user = User.new(user_params)

    if user.save