app/interactions/component/component_create.rb

  def execute
    Component.create!(
      page_id: page_id,
      heading: heading,
      component_query: component_query,
      component_order: component_order,
      component_type: component_type
    )
---
INSERT INTO "components" ("heading", "component_order", "component_type", "component_query", "page_id", "created_at", "updated_at", "settings", "deleted_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"